apache/nuttx/arch/arm/src/common/stm32/stm32_i2c_m3m4_v1_alt.c
  else if ((priv->flags & (I2C_M_READ)) != 0 && (status & I2C_SR1_RXNE) != 0)
    {
      /* When read flag is set and the receive buffer is not empty
       * (RXNE is set) then the driver can read from the data register.
       */

      i2cinfo("Entering read mode dcnt = %i msgc = %i, status %" PRIi32 "\n",
              priv->dcnt, priv->msgc, status);

      /* Implementation of method 2 for receiving data following
       * the stm32f1xx reference manual.
       */

      /* Case total message length = 1 */

      if (priv->dcnt == 0 && priv->total_msg_len == 1)
        {
          i2cinfo("short read N=1: Read data from data register(DR)\n");

          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);
          priv->dcnt--;
          stm32_i2c_traceevent(priv, I2CEVENT_READ, 0);
        }

      /* Case total message length = 2 */

      else if (priv->dcnt == 2 && priv->total_msg_len == 2 &&
               !(status & I2C_SR1_BTF))
        {
          i2cinfo("short read N=2: "
                  "DR full, SR empty. Waiting for more bytes.\n");
          stm32_i2c_traceevent(priv, I2CEVENT_READ_SR_EMPTY, 0);
        }
      else if (priv->dcnt == 2 && priv->total_msg_len == 2 &&
               (status & I2C_SR1_BTF))
        {
          i2cinfo("short read N=2: "
                  "DR and SR full setting stop bit and reading twice\n");

          stm32_i2c_sendstop(priv);
          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);
          priv->dcnt--;
          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);
          priv->dcnt--;

          /* Stop request already programmed so set dcnt for next message */

          priv->dcnt--;

          /* Set trace */

          stm32_i2c_traceevent(priv, I2CEVENT_READ_2, 0);
        }

      /* Case total message length >= 3 */

      else if (priv->total_msg_len >= 3 && !(status & I2C_SR1_BTF))
        {
          /* If the shift register is still empty (i.e. BTF is low)
           * then do nothing and wait for it to fill in the next ISR.
           * (should not happen in ISR mode, but if using polled mode
           * this should be able to handle it).
           */

          i2cinfo("DR full, SR empty. Waiting for more bytes.\n");
          stm32_i2c_traceevent(priv, I2CEVENT_READ_SR_EMPTY, 0);
        }
      else if (priv->dcnt >= 4 &&
               priv->total_msg_len >= 3 && (status & I2C_SR1_BTF))
        {
          /* Read data from data register(DR). Note this clears the
           * RXNE(receive buffer not empty) flag.
           */

          i2cinfo("Read data from data register(DR)\n");
          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);

          /* Decrease current message length */

          priv->dcnt--;
          stm32_i2c_traceevent(priv, I2CEVENT_READ, 0);
        }
      else if (priv->dcnt == 3 &&
              (status & I2C_SR1_BTF) && priv->total_msg_len >= 3)
        {
          /* This means that we are reading dcnt 3 and there is
           * already dcnt 2 in the shift register.
           * This coincides with EV7_2 in the reference manual.
           */

          i2cinfo("Program NACK\n");
          i2cinfo("Read data from data register(DR) dcnt=3\n");

          stm32_i2c_traceevent(priv, I2CEVENT_READ_3, priv->dcnt);

          /* Program NACK */

          stm32_i2c_modifyreg(priv, STM32_I2C_CR1_OFFSET, I2C_CR1_ACK, 0);

          /* Read dcnt = 3, to ensure a BTF event after having received
           * in the shift register.
           */

          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);

          /* Decrease current message length */

          priv->dcnt--;
        }
      else if (priv->dcnt == 2 &&
              (status & I2C_SR1_BTF) && priv->total_msg_len >= 3)
        {
          i2cinfo("Program stop\n");
          i2cinfo("Read data from data register(DR) dcnt=2\n");
          i2cinfo("Read data from data register(SR) dcnt=1\n");
          i2cinfo("Setting condition to stop ISR dcnt = -1\n");

          stm32_i2c_traceevent(priv, I2CEVENT_READ_3, priv->dcnt);

          /* Program stop */

          stm32_i2c_sendstop(priv);

          /* read dcnt = 2 */

          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);

          /* read last byte dcnt=1 */

          *priv->ptr++ = stm32_i2c_getreg(priv, STM32_I2C_DR_OFFSET);

          /* Stop already sent will not get another interrupt set
           * condition to stop ISR
           */

          priv->dcnt = -1;
        }

      /* Error handling for read mode */

      else
        {
          i2cerr("ERROR: I2C read mode no correct state detected\n");
          i2cerr("  state %" PRIi32 ", dcnt=%i\n", status, priv->dcnt);

          /* set condition to terminate ISR and wake waiting thread */

          priv->dcnt = -1;
          priv->msgc = 0;
          stm32_i2c_traceevent(priv, I2CEVENT_READ_ERROR, 0);
        }

      /* Read rest of the state */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);
    }

  /* Empty call handler
   *
   * Case to handle an empty call to the ISR where it only has to
   * Shutdown
   */

  else if (priv->dcnt == -1 && priv->msgc == 0)
    {
      /* Read rest of the state */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);
      i2cwarn("WARNING: Empty call to ISR: Stopping ISR\n");
      stm32_i2c_traceevent(priv, I2CEVENT_ISR_EMPTY_CALL, 0);
    }

  /* Error handler
   *
   * Gets triggered if the driver does not recognize a situation(state)
   * it can deal with.
   * This should not happen in interrupt based operation(i.e. when
   * CONFIG_I2C_POLLED is not set in the defconfig file).
   * During polled operation(i.e. CONFIG_I2C_POLLED=y in defconfig)
   * this case should do nothing but tracing the event that the
   * device wasn't ready yet.
   */

  else
    {
#ifdef CONFIG_I2C_POLLED
      stm32_i2c_traceevent(priv, I2CEVENT_POLL_DEV_NOT_RDY, 0);
#else
      /* Read rest of the state */

      status |= (stm32_i2c_getreg(priv, STM32_I2C_SR2_OFFSET) << 16);

      i2cerr("ERROR:  "
             "No correct state detected(start bit, read or write)\n");
      i2cerr("   state %" PRIi32 "\n", status);

